Revit 2027 API
CustomExporter Constructor
 Constructs a new instance of a CustomExporter for a given document using the input instance of IExportContext as the output device.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CustomExporter(
	Document document,
	IExportContext context
)
Public Sub New (
	document As Document,
	context As IExportContext
)
public:
CustomExporter(
	Document^ document,
	IExportContext^ context
)
new :
        document : Document *
        context : IExportContext -> CustomExporter
Parameters
document Document
 The document containing the model to be exported
context IExportContext
 An instance of a context class that will be consuming the output
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The input context should be an instance of a class that implements either IModelExportContext or IPhotoRenderContext interfaces.
See Also
Reference
CustomExporter Class
Autodesk.Revit.DB Namespace